c5/src/Documents/Entry/Entry.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Entry</name>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Operation</name>
    <type>
      <types>CatalogRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>DefinedType.Reference</types>
    </type>
  </attributes>
  <attributes>
    <name>ReferenceDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Simple</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Records</name>
    <attributes>
      <name>AccountCr</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountDr</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountCr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountDr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Content</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyAmountCr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyAmountDr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyCr</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyDr</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr1</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr2</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr3</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr1</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr2</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr3</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>FactorCr</name>
      <type>
        <types>DefinedType.Factor</types>
      </type>
    </attributes>
    <attributes>
      <name>FactorDr</name>
      <type>
        <types>DefinedType.Factor</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityCr</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityDr</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RateCr</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
    <attributes>
      <name>RateDr</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Documents/Entry/Forms/Record/Module.bsl
&AtClient
var TableRow export;
&AtClient
var DrData export;
&AtClient
var CrData export;

// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	loadParams ();
	disableAccounts ();
	InvoiceForm.SetLocalCurrency ( ThisObject );
	Options.Company ( ThisObject, Object.Company );
	
EndProcedure

&AtServer
Procedure loadParams ()
	
	Object.Company = Parameters.Company;
	
EndProcedure 

&AtServer
Procedure disableAccounts ()
	
	Items.AccountDr.ReadOnly = Parameters.DisableDr;
	Items.AccountCr.ReadOnly = Parameters.DisableCr;
	
EndProcedure 

&AtClient
Procedure OnOpen ( Cancel )
	
	loadData ();
	EntryForm.EnableAnalytics ( ThisObject );
	EntryForm.DisableCurrency ( ThisObject, "Dr" );
	EntryForm.DisableCurrency ( ThisObject, "Cr" );
	activateAccount ();
	
EndProcedure

&AtClient
Procedure loadData ()
	
	TableRow = Object.Records.Add ();
	FillPropertyValues ( TableRow, FormOwner.Items.Records.CurrentData );
	EntryForm.FixAccounts ( ThisObject );
	EntryForm.InitAccounts ( ThisObject );
	
EndProcedure 

&AtClient
Procedure activateAccount ()
	
	if ( Parameters.NewRow ) then
		return;
	endif;
	if ( not AccountDr.IsEmpty ()
		and not Parameters.DisableDr ) then
		CurrentItem = Items.AccountDr;
	elsif ( not AccountCr.IsEmpty ()
		and not Parameters.DisableCr ) then
		CurrentItem = Items.AccountCr;
	endif;
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure OK ( Command )
	
	applyCommand ( Enum.ChoiceOperationsEntryRecord () );
	
EndProcedure

&AtClient
Procedure applyCommand ( Command )
	
	FormOwner.Modified = true;
	Close ( new Structure ( "Operation, Value", Command, TableRow ) );
	
EndProcedure 

&AtClient
Procedure SaveAndNew ( Command )
	
	applyCommand ( Enum.ChoiceOperationsEntrySaveAndNew () );
	
EndProcedure

&AtClient
Procedure AccountDrOnChange ( Item )
	
	EntryForm.AccountDrOnChange ( ThisObject );
	
EndProcedure

&AtClient
Procedure DimDr1StartChoice ( Item, ChoiceData, StandardProcessing )
	
	EntryForm.DimDr1StartChoice ( ThisObject, Item, ChoiceData, StandardProcessing );
	
EndProcedure

&AtClient
Procedure DimDr1OnChange ( Item )
	
	EntryForm.DimDr1OnChange ( ThisObject, Item );
	
EndProcedure

&AtClient
Procedure DimDr2StartChoice ( Item, ChoiceData, StandardProcessing )
	
	EntryForm.DimDr2StartChoice ( ThisObject, Item, ChoiceData, StandardProcessing );
	
EndProcedure

&AtClient
Procedure DimDr2OnChange ( Item )
	
	EntryForm.DimDr2OnChange ( ThisObject, Item );
	
EndProcedure

&AtClient
Procedure DimDr3StartChoice ( Item, ChoiceData, StandardProcessing )
	
	EntryForm.DimDr3StartChoice ( ThisObject, Item, ChoiceData, StandardProcessing );
	
EndProcedure

&AtClient
Procedure CurrencyDrOnChange ( Item )
	
	EntryForm.CurrencyDrOnChange ( ThisObject, Item );

EndProcedure

&AtClient
Procedure RateDrOnChange ( Item )
	
	EntryForm.RateDrOnChange ( ThisObject, Item );
	
EndProcedure

&AtClient
Procedure FactorDrOnChange ( Item )
	
	EntryForm.FactorDrOnChange ( ThisObject, Item );

EndProcedure

&AtClient
Procedure CurrencyAmountDrOnChange ( Item )
	
	EntryForm.CurrencyAmountDrOnChange ( ThisObject, Item );
	
EndProcedure

&AtClient
Procedure AccountCrOnChange ( Item )
	
	EntryForm.AccountCrOnChange ( ThisObject );
	
EndProcedure

&AtClient
Procedure DimCr1StartChoice ( Item, ChoiceData, StandardProcessing )
	
	EntryForm.DimCr1StartChoice ( ThisObject, Item, ChoiceData, StandardProcessing );
	
EndProcedure

&AtClient
Procedure DimCr1OnChange ( Item )
	
	EntryForm.DimCr1OnChange ( ThisObject, Item );
	
EndProcedure

&AtClient
Procedure DimCr2StartChoice ( Item, ChoiceData, StandardProcessing )
	
	EntryForm.DimCr2StartChoice ( ThisObject, Item, ChoiceData, StandardProcessing );
	
EndProcedure

&AtClient
Procedure DimCr2OnChange ( Item )
	
	EntryForm.DimCr2OnChange ( ThisObject, Item );
	
EndProcedure

&AtClient
Procedure DimCr3StartChoice ( Item, ChoiceData, StandardProcessing )
	
	EntryForm.DimCr3StartChoice ( ThisObject, Item, ChoiceData, StandardProcessing );
	
EndProcedure

&AtClient
Procedure CurrencyCrOnChange ( Item )
	
	EntryForm.CurrencyCrOnChange ( ThisObject, Item );

EndProcedure

&AtClient
Procedure RateCrOnChange ( Item )
	
	EntryForm.RateCrOnChange ( ThisObject, Item );
	
EndProcedure

&AtClient
Procedure FactorCrOnChange ( Item )
	
	EntryForm.FactorCrOnChange ( ThisObject, Item );

EndProcedure

&AtClient
Procedure CurrencyAmountCrOnChange ( Item )
	
	EntryForm.CurrencyAmountCrOnChange ( ThisObject, Item );
	
EndProcedure

&AtClient
Procedure AmountOnChange ( Item )
	
	EntryForm.AmountOnChange ( ThisObject, Item );
	
EndProcedure
